
// https://open.krx.co.kr/contents/MKD/01/0110/01100305/MKD01100305.jsp
export const HOLIDAYS_2022: string[] = [
  "2022-01-31", // 설날
  "2022-02-01", // 설날
  "2022-02-02", // 설날
  "2022-03-01", // 삼일절
  "2022-03-09", // 20대 대통령 선거
  "2022-05-05", // 어린이날
  "2022-06-01", // 8회 지방선거
  "2022-06-06", // 현충일
  "2022-08-15", // 광복절
  "2022-09-09", // 추석
  "2022-09-12", // 추석(대체휴일)
  "2022-10-03", // 개천절
  "2022-10-10", // 한글날(대체휴일)
];

export const TRADING_HOLIDAYS_2022: string[] = [
  ...HOLIDAYS_2022,
  "2022-12-30", // 연말휴장일
];
