import type { DateString } from "../types";

// https://open.krx.co.kr/contents/MKD/01/0110/01100305/MKD01100305.jsp
export const HOLIDAYS_2023: DateString[] = [
  "2023-01-23", // 설날
  "2023-01-24", // 설날(대체휴일)
  "2023-03-01", // 삼일절
  "2023-05-01", // 근로자의날
  "2023-05-05", // 어린이날
  "2023-05-29", // 석가탄신일(대체휴일)
  "2023-06-06", // 현충일
  "2023-08-15", // 광복절
  "2023-09-28", // 추석
  "2023-09-29", // 추석
  "2023-10-02", // 임시공휴일
  "2023-10-03", // 개천절
  "2023-10-09", // 한글날
  "2023-12-25", // 성탄절
];

export const TRADING_HOLIDAYS_2023: DateString[] = [
  ...HOLIDAYS_2023,
  "2023-12-29", // 연말휴장일
];
