import type { DateString } from "../types.ts";

// https://open.krx.co.kr/contents/MKD/01/0110/01100305/MKD01100305.jsp
export const HOLIDAYS_2024: DateString[] = [
  "2024-01-01", // 신정
  "2024-02-09", // 설날
  "2024-02-12", // 설날(대체휴일)
  "2024-03-01", // 삼일절
  "2024-04-10", // 임시공휴일
  "2024-05-01", // 근로자의날
  "2024-05-06", // 어린이날(대체휴일)
  "2024-05-15", // 석가탄신일
  "2024-06-06", // 현충일
  "2024-08-15", // 광복절
  "2024-09-16", // 추석
  "2024-09-17", // 추석
  "2024-09-18", // 추석
  "2024-10-01", // 임시공휴일
  "2024-10-03", // 개천절
  "2024-10-09", // 한글날
  "2024-12-25", // 성탄절
];

export const TRADING_HOLIDAYS_2024: DateString[] = [
  ...HOLIDAYS_2024,
  "2024-12-31", // 연말휴장일
];
