import type { DateString } from "../types.ts";

// https://open.krx.co.kr/contents/MKD/01/0110/01100305/MKD01100305.jsp
export const HOLIDAYS_2025: DateString[] = [
  "2025-01-01", // 신정
  "2025-01-27", // 임시공휴일
  "2025-01-28", // 설날
  "2025-01-29", // 설날
  "2025-01-30", // 설날
  "2025-03-03", // 삼일절(대체휴일)
  "2025-05-01", // 근로자의날
  "2025-05-05", // 석가탄신일
  "2025-05-06", // 어린이날(대체휴일)
  "2025-06-03", // 임시공휴일
  "2025-06-06", // 현충일
  "2025-08-15", // 광복절
  "2025-10-03", // 개천절
  "2025-10-06", // 추석
  "2025-10-07", // 추석
  "2025-10-08", // 추석(대체휴일)
  "2025-10-09", // 한글날
  "2025-12-25", // 성탄절
];

export const TRADING_HOLIDAYS_2025: DateString[] = [
  ...HOLIDAYS_2025,
  "2025-12-31", // 연말휴장일
];
