import type { DateString } from "../types.ts";

// https://open.krx.co.kr/contents/MKD/01/0110/01100305/MKD01100305.jsp
export const HOLIDAYS_2026: DateString[] = [
  "2026-01-01", // 신정
  "2026-02-16", // 설날
  "2026-02-17", // 설날
  "2026-02-18", // 설날
  "2026-03-02", // 삼일절(대체휴일)
  "2026-05-01", // 근로자의날
  "2026-05-05", // 어린이날
  "2026-05-25", // 석가탄신일(대체휴일)
  "2026-08-17", // 광복절(대체휴일)
  "2026-09-24", // 추석
  "2026-09-25", // 추석
  "2026-10-05", // 개천절(대체휴일)
  "2026-10-09", // 한글날
  "2026-12-25", // 성탄절
];

export const TRADING_HOLIDAYS_2026: DateString[] = [
  ...HOLIDAYS_2026,
  "2026-12-31", // 연말휴장일
];
