
// https://open.krx.co.kr/contents/MKD/01/0110/01100305/MKD01100305.jsp
export const HOLIDAYS_2027: string[] = [
  "2027-01-01", // 신정
  "2027-02-08", // 설날
  "2027-02-09", // 설날(대체휴일)
  "2027-03-01", // 삼일절
  "2027-05-05", // 어린이날
  "2027-05-13", // 석가탄신일
  "2027-08-16", // 광복절(대체휴일)
  "2027-09-14", // 추석
  "2027-09-15", // 추석
  "2027-09-16", // 추석
  "2027-10-04", // 개천절(대체휴일)
  "2027-10-11", // 한글날(대체휴일)
  "2027-12-27", // 성탄절(대체휴일)
];

export const TRADING_HOLIDAYS_2027: string[] = [
  ...HOLIDAYS_2027,
  "2027-12-31", // 연말휴장일
];
